# <span style="color:orange">Pandas</span>

widely used for data manipulation and analysis.

In [1]:
import pandas as pd
import numpy as np

In [2]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__deprecated_num_index_names',
 '__dir__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_testing',
 '_typing',
 '_version',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [3]:
x1=np.random.randint(1,50,10)
print("x1 = ",x1)

x1 =  [36 42  7 45 44 25  8  3 14  7]

In [4]:
sd1=pd.Series(x1)
print(sd1)

0    36
1    42
2     7
3    45
4    44
5    25
6     8
7     3
8    14
9     7
dtype: int64

In [5]:
x2=np.random.randint(25,100,5)
sd2=pd.Series(x2,index=["Tamil","English","Math","Science","Social"],name="hari_mark")
print(sd2)

Tamil      77
English    37
Math       80
Science    77
Social     57
Name: hari_mark, dtype: int64

In [6]:
d1={"suppu":[56,31,56],"hari":[65,63,48]}
sd3=pd.Series(d1)
print(sd3)

suppu    [56, 31, 56]
hari     [65, 63, 48]
dtype: object

In [7]:
sd2[["Tamil","English"]]

Tamil      77
English    37
Name: hari_mark, dtype: int64

In [8]:
x3={"laptop":["i7","8GB","1TB"],"mobile":["snapdragon","6GB","128"]}
ds1=pd.DataFrame(x3)
print(ds1)

  laptop      mobile
0     i7  snapdragon
1    8GB         6GB
2    1TB         128

In [9]:
x4={"laptop":["i7","8GB","1TB"],"mobile":["snapdragon","6GB","128"]}
ds2=pd.DataFrame(x4,index=["processor","RAM","Memory"])
print(ds2)

          laptop      mobile
processor     i7  snapdragon
RAM          8GB         6GB
Memory       1TB         128

In [10]:
ds2.insert(0,"PC",["i9","32GB","2TB"])

In [11]:
ds2

             PC laptop      mobile
processor    i9     i7  snapdragon
RAM        32GB    8GB         6GB
Memory      2TB    1TB         128

In [12]:
ds2["PC"]

processor      i9
RAM          32GB
Memory        2TB
Name: PC, dtype: object

In [13]:
ds2.loc['RAM']

PC        32GB
laptop     8GB
mobile     6GB
Name: RAM, dtype: object

In [14]:
ds2.iloc[2]

PC        2TB
laptop    1TB
mobile    128
Name: Memory, dtype: object

In [15]:
ds3=pd.read_excel("all_shifts.xlsx")

In [16]:
ds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 298 entries, 0 to 297
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Shift       298 non-null    int64
 1   Region      298 non-null    object
 2   Sales Rep   298 non-null    object
 3   Product     298 non-null    object
 4   Cost per    298 non-null    int64
 5   Units Sold  298 non-null    int64
dtypes: int64(3), object(3)
memory usage: 14.1+ KB

In [17]:
ds3

     Shift Region Sales Rep  Product  Cost per  Units Sold
0        1  South    Meggan    Paper        15         163
1        1  South    Charis  Stapler        25         108
2        1  South    Shayne   Pencil         5         118
3        1  North   Krystin      Pen        10          37
4        1  South       Leo    Paper        15         131
..     ...    ...       ...      ...       ...         ...
293      3  South     Willa      Pen        10          42
294      3   West    Shayne    Paper        15         168
295      3   East    Adrian   Binder        30         132
296      3   East     Willa    Paper        15         111
297      3   East     Diann   Folder        17         151

[298 rows x 6 columns]

In [18]:
ds3.head()

   Shift Region Sales Rep  Product  Cost per  Units Sold
0      1  South    Meggan    Paper        15         163
1      1  South    Charis  Stapler        25         108
2      1  South    Shayne   Pencil         5         118
3      1  North   Krystin      Pen        10          37
4      1  South       Leo    Paper        15         131

In [19]:
ds3.tail()

     Shift Region Sales Rep Product  Cost per  Units Sold
293      3  South     Willa     Pen        10          42
294      3   West    Shayne   Paper        15         168
295      3   East    Adrian  Binder        30         132
296      3   East     Willa   Paper        15         111
297      3   East     Diann  Folder        17         151

In [20]:
ds3[ds3["Region"]=="North"]  # to sort region == north

     Shift Region Sales Rep  Product  Cost per  Units Sold
3        1  North   Krystin      Pen        10          37
6        1  North   Estelle  Stapler        25         129
8        1  North       Ami  Stapler        25         139
15       1  North    Delpha    Paper        15          75
19       1  North     Jimmy   Pencil         5         167
..     ...    ...       ...      ...       ...         ...
261      3  North   Dorthea   Pencil         5         125
263      3  North     Betsy   Folder        17         168
269      3  North    Odilia  Stapler        25         200
273      3  North       Ami   Folder        17         185
283      3  North     Jimmy  Stapler        25         190

[79 rows x 6 columns]

In [21]:
ds3[ds3["Product"]=="Pen"]

     Shift Region Sales Rep Product  Cost per  Units Sold
3        1  North   Krystin     Pen        10          37
7        1   East    Delpha     Pen        10         100
9        1   West   Cristen     Pen        10         144
11       1  South    Shelli     Pen        10         196
12       1   West   Deandra     Pen        10          73
16       1   West  Claudine     Pen        10         131
17       1  South    Martha     Pen        10          49
24       1   East     Nolan     Pen        10         168
28       1   West    Shelli     Pen        10          38
35       1   East   Dorthea     Pen        10          85
38       1  North      Nola     Pen        10          42
55       1   West   Lisbeth     Pen        10         170
64       1   West    Charis     Pen        10         137
69       1   West    Damion     Pen        10          55
71       1   East  Shirlene     Pen        10         132
85       1   West    Winter     Pen        10         184
91       1   East     Diann     Pen        10          63
92       1  North    Lashon     Pen        10         191
100      2  North     Tyree     Pen        10          83
103      2   West  Willette     Pen        10         117
104      2  North    Damion     Pen        10         125
108      2   West   Cordell     Pen        10         108
111      2  South    Jammie     Pen        10         180
112      2  South     Chaya     Pen        10         102
135      2  South     Tyree     Pen        10         162
136      2  North      Dina     Pen        10          61
141      2  North  Anderson     Pen        10          93
142      2   West      Raye     Pen        10         151
146      2  South    Damion     Pen        10         122
150      2   West   Deandra     Pen        10         115
152      2  South    Shayne     Pen        10          87
158      2  North  Jesusita     Pen        10         163
174      2  North  Jesusita     Pen        10         126
175      2  South     Jimmy     Pen        10         145
181      2   East    Adrian     Pen        10          63
183      2   East    Martha     Pen        10          44
206      3   West   Deandra     Pen        10         135
216      3   East       Ami     Pen        10          67
238      3   West      Dina     Pen        10          59
239      3  South  Anderson     Pen        10         138
245      3   West  Jesusita     Pen        10          59
253      3  North   Racquel     Pen        10          87
254      3   East     Tyree     Pen        10          82
260      3   West       Von     Pen        10         176
270      3   East      Raye     Pen        10          87
274      3  South      Kaci     Pen        10          88
278      3  South    Kelvin     Pen        10         101
279      3   West      Lola     Pen        10         185
282      3  South    Keitha     Pen        10         135
284      3   East    Shelli     Pen        10         112
286      3   West   Deandra     Pen        10          78
292      3   West   Estelle     Pen        10          83
293      3  South     Willa     Pen        10          42

In [22]:
ds3[ds3["Units Sold"]>180]

     Shift Region Sales Rep  Product  Cost per  Units Sold
11       1  South    Shelli      Pen        10         196
51       1   West      Dina   Folder        17         183
54       1  South   Dorthea   Binder        30         191
57       1  North     Nisha   Folder        17         195
58       1  North    Delpha   Folder        17         198
67       1   East     Jimmy   Folder        17         193
75       1  South     Tyree    Paper        15         197
77       1   East   Cristen   Binder        30         182
78       1  North     Willa    Paper        15         200
83       1   West     Betsy  Stapler        25         187
85       1   West    Winter      Pen        10         184
92       1  North    Lashon      Pen        10         191
96       1  North  Jesusita   Binder        30         200
102      2   East     Caleb   Binder        30         186
122      2   West     Tyree  Stapler        25         186
126      2   East     Betsy    Paper        15         186
153      2   West  Anderson   Pencil         5         182
156      2  South     Nolan   Folder        17         200
157      2  North    Jammie  Stapler        25         194
159      2   West     Willa    Paper        15         193
160      2  North    Keitha  Stapler        25         181
164      2  South   Cristen   Binder        30         185
193      2   West  Anderson   Binder        30         187
201      3   West    Shelli   Folder        17         185
210      3   West  Shirlene   Folder        17         191
215      3  North   Cordell  Stapler        25         196
222      3  South      Raye   Pencil         5         195
225      3  South    Meggan   Pencil         5         191
228      3   West   Cordell  Stapler        25         182
237      3  South    Lashon  Stapler        25         182
264      3   East      Raye   Pencil         5         184
267      3  South    Damion   Folder        17         182
269      3  North    Odilia  Stapler        25         200
273      3  North       Ami   Folder        17         185
279      3   West      Lola      Pen        10         185
280      3   East   Jenifer   Pencil         5         186
283      3  North     Jimmy  Stapler        25         190

In [23]:
ds2

             PC laptop      mobile
processor    i9     i7  snapdragon
RAM        32GB    8GB         6GB
Memory      2TB    1TB         128

In [24]:
ds2.to_excel("electronic_acc.xlsx")  # export Data to excel

In [25]:
# TO REMOVE A column
del ds2["mobile"]

In [26]:
ds2

             PC laptop
processor    i9     i7
RAM        32GB    8GB
Memory      2TB    1TB

In [27]:
# to delete a row
ds2.drop(["processor"])

          PC laptop
RAM     32GB    8GB
Memory   2TB    1TB

In [28]:
xe=[65,632,63564,6526,3,1,3231,32,6]
xs=set(xe)
xs

{1, 3, 6, 32, 65, 632, 3231, 6526, 63564}

In [29]:
p1=np.random.randint(25,100,5)
p2=np.random.randint(25,100,5)
p3=np.random.randint(25,100,5)
p4=np.random.randint(25,100,5)
p5=np.random.randint(25,100,5)
p6=np.random.randint(25,100,5)
p7=np.random.randint(25,100,5)
p8=np.random.randint(25,100,5)
p9=np.random.randint(25,100,5)
p10=np.random.randint(25,100,5)

In [30]:
ds4=pd.DataFrame({"person_1":p1,"person_2":p2,"person_3":p3,"person_4":p4,"person_5":p5,
                "person_6":p6,"person_7":p7,"person_8":p8,"person_9":p9,"person_10":p10},index=["Tamil","English","Maths","Science","Social"])

In [31]:
ds4.index

Index(['Tamil', 'English', 'Maths', 'Science', 'Social'], dtype='object')

In [32]:
ds4["person_3"]

Tamil      60
English    57
Maths      25
Science    50
Social     88
Name: person_3, dtype: int64

In [33]:
ds4["person_3"].sum()

280

In [34]:
tot=pd.DataFrame({"person_1":ds4["person_1"].sum(),"person_2":[ds4["person_2"].sum()],"person_3":[ds4["person_3"].sum()],"person_4":[ds4["person_4"].sum()],"person_5":[ds4["person_5"].sum()],"person_6":[ds4["person_6"].sum()],
        "person_7":[ds4["person_7"].sum()],"person_8":[ds4["person_8"].sum()],"person_9":[ds4["person_9"].sum()],"person_10":[ds4["person_10"].sum()]},index=["Total"])

In [35]:
ds5=pd.concat([ds4,tot])

In [36]:
ds5

,person_1,person_2,person_3,person_4,person_5,person_6,person_7,person_8,person_9,person_10
Tamil,77,46,60,41,81,78,61,80,70,66
English,93,31,57,94,88,50,79,78,60,34
Maths,84,75,25,96,47,68,33,81,90,85
Science,29,56,50,65,88,87,91,43,64,71
Social,81,62,88,34,25,92,43,84,32,25
Total,364,270,280,330,329,375,307,366,316,281

In [37]:
ds4

,person_1,person_2,person_3,person_4,person_5,person_6,person_7,person_8,person_9,person_10
Tamil,77,46,60,41,81,78,61,80,70,66
English,93,31,57,94,88,50,79,78,60,34
Maths,84,75,25,96,47,68,33,81,90,85
Science,29,56,50,65,88,87,91,43,64,71
Social,81,62,88,34,25,92,43,84,32,25

In [38]:
ds4["person_2"][3]=35  # to change particular element.

In [39]:
ds4[ds4<35]  # to check values under condition.

,person_1,person_2,person_3,person_4,person_5,person_6,person_7,person_8,person_9,person_10
Tamil,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
English,NaN,31.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,34.0
Maths,NaN,NaN,25.0,NaN,NaN,NaN,33.0,NaN,NaN,NaN
Science,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Social,NaN,NaN,NaN,34.0,25.0,NaN,NaN,NaN,32.0,25.0

In [40]:
ds4.idxmax()

person_1     English
person_2       Maths
person_3      Social
person_4       Maths
person_5     English
person_6      Social
person_7     Science
person_8      Social
person_9       Maths
person_10      Maths
dtype: object

In [41]:
ds4.idxmin()          # to check minimum in column

person_1     Science
person_2     English
person_3       Maths
person_4      Social
person_5      Social
person_6     English
person_7       Maths
person_8     Science
person_9      Social
person_10     Social
dtype: object

In [42]:
me=ds4.mean().T  # T => Transpose

In [43]:
ds4.loc["mean"]=me

In [44]:
ds4

,person_1,person_2,person_3,person_4,person_5,person_6,person_7,person_8,person_9,person_10
Tamil,77.0,46.0,60.0,41.0,81.0,78.0,61.0,80.0,70.0,66.0
English,93.0,31.0,57.0,94.0,88.0,50.0,79.0,78.0,60.0,34.0
Maths,84.0,75.0,25.0,96.0,47.0,68.0,33.0,81.0,90.0,85.0
Science,29.0,35.0,50.0,65.0,88.0,87.0,91.0,43.0,64.0,71.0
Social,81.0,62.0,88.0,34.0,25.0,92.0,43.0,84.0,32.0,25.0
mean,72.8,49.8,56.0,66.0,65.8,75.0,61.4,73.2,63.2,56.2

In [45]:
ds4.rank()

,person_1,person_2,person_3,person_4,person_5,person_6,person_7,person_8,person_9,person_10
Tamil,3.0,3.0,5.0,2.0,4.0,4.0,3.0,4.0,5.0,4.0
English,6.0,1.0,4.0,5.0,5.5,1.0,5.0,3.0,2.0,2.0
Maths,5.0,6.0,1.0,6.0,2.0,2.0,1.0,5.0,6.0,6.0
Science,1.0,2.0,2.0,3.0,5.5,5.0,6.0,1.0,4.0,5.0
Social,4.0,5.0,6.0,1.0,1.0,6.0,2.0,6.0,1.0,1.0
mean,2.0,4.0,3.0,4.0,3.0,3.0,4.0,2.0,3.0,3.0

In [46]:
ds4

,person_1,person_2,person_3,person_4,person_5,person_6,person_7,person_8,person_9,person_10
Tamil,77.0,46.0,60.0,41.0,81.0,78.0,61.0,80.0,70.0,66.0
English,93.0,31.0,57.0,94.0,88.0,50.0,79.0,78.0,60.0,34.0
Maths,84.0,75.0,25.0,96.0,47.0,68.0,33.0,81.0,90.0,85.0
Science,29.0,35.0,50.0,65.0,88.0,87.0,91.0,43.0,64.0,71.0
Social,81.0,62.0,88.0,34.0,25.0,92.0,43.0,84.0,32.0,25.0
mean,72.8,49.8,56.0,66.0,65.8,75.0,61.4,73.2,63.2,56.2

In [47]:
ds4.sort_index()

,person_1,person_2,person_3,person_4,person_5,person_6,person_7,person_8,person_9,person_10
English,93.0,31.0,57.0,94.0,88.0,50.0,79.0,78.0,60.0,34.0
Maths,84.0,75.0,25.0,96.0,47.0,68.0,33.0,81.0,90.0,85.0
Science,29.0,35.0,50.0,65.0,88.0,87.0,91.0,43.0,64.0,71.0
Social,81.0,62.0,88.0,34.0,25.0,92.0,43.0,84.0,32.0,25.0
Tamil,77.0,46.0,60.0,41.0,81.0,78.0,61.0,80.0,70.0,66.0
mean,72.8,49.8,56.0,66.0,65.8,75.0,61.4,73.2,63.2,56.2

In [48]:
ds4.index

Index(['Tamil', 'English', 'Maths', 'Science', 'Social', 'mean'], dtype='object')

In [49]:
ds4["person_6"].min()

50.0

In [50]:
ds4["person_6"].max()

92.0

In [52]:
ds4["person_4"].idxmax()

'Maths'

To understand correlation statistics through an example, we will calculate the Pearson correlation coefficient between two sets of data and explain how the correlation is derived using the sum of their deviations from the mean. Let's break down the steps and calculations involved.

### Data
Consider the following two sets of data:

- \( X = [1, 2, 3, 4, 5] \)
- \( Y = [2, 4, 5, 4, 5] \)

### Steps to Calculate Pearson Correlation Coefficient

1. **Calculate the Mean of X and Y:** <br>
   $
   \text{mean}(X) = \frac{1+2+3+4+5}{5} = 3
   $<br>
   $
   \text{mean}(Y) = \frac{2+4+5+4+5}{5} = 4
   $

2. **Calculate the Deviations from the Mean:**<br>
   $
   X' = X - \text{mean}(X) = [1-3, 2-3, 3-3, 4-3, 5-3] = [-2, -1, 0, 1, 2]
   $<br>
   $
   Y' = Y - \text{mean}(Y) = [2-4, 4-4, 5-4, 4-4, 5-4] = [-2, 0, 1, 0, 1]
   $

3. **Calculate the Sum of the Products of Deviations:**<br>
   $
   \sum (X'Y') = (-2 \cdot -2) + (-1 \cdot 0) + (0 \cdot 1) + (1 \cdot 0) + (2 \cdot 1) = 4 + 0 + 0 + 0 + 2 = 6
   $

4. **Calculate the Sum of the Squared Deviations:**<br>
   $
   \sum (X'^2) = (-2)^2 + (-1)^2 + 0^2 + 1^2 + 2^2 = 4 + 1 + 0 + 1 + 4 = 10
   $<br>
   $
   \sum (Y'^2) = (-2)^2 + 0^2 + 1^2 + 0^2 + 1^2 = 4 + 0 + 1 + 0 + 1 = 6
   $

5. **Calculate the Pearson Correlation Coefficient:**<br>
   $
   r = \frac{\sum (X'Y')}{\sqrt{\sum (X'^2) \cdot \sum (Y'^2)}} = \frac{6}{\sqrt{10 \cdot 6}} = \frac{6}{\sqrt{60}} = \frac{6}{\sqrt{60}} = \frac{6}{7.746} \approx 0.7746
   $

### Interpretation

The Pearson correlation coefficient $r \approx 0.7746$ indicates a strong positive linear relationship between the variables  X and Y.

In [ ]:
ds4["person_1"].corr(ds4["person_4"])

In [ ]:
ds3

In [ ]:
ds3.groupby("Product").groups

In [ ]:
ds3.groupby(["Product","Region"]).groups

In [ ]:
ds4.describe()

In [2]:
import requests as rq

In [3]:
header = {
  "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.75 Safari/537.36",
  "X-Requested-With": "XMLHttpRequest"
}

In [14]:
wd=rq.get("https://www.spaceweatherlive.com/",headers=header)

In [15]:
wd

In [16]:
wdp=pd.read_html(wd.text)

In [17]:
len(wdp)

10

In [18]:
wdp[0]

  Unnamed: 0  Min. Max.
0     Sunday   Kp2  Kp4
1     Monday  Kp2-  Kp3
2    Tuesday  Kp2-  Kp4

In [19]:
wdp

[  Unnamed: 0  Min. Max.
 0     Sunday   Kp2  Kp4
 1     Monday  Kp2-  Kp3
 2    Tuesday  Kp2-  Kp4,
                      0   1
 0  Northern hemisphere NaN
 1  Southern hemisphere NaN,
    Region  Number of sunspots  Class Magn. Class Spot
 0    3708                   1          NaN        AXX
 1    3709                   3          NaN        AXX
 2    3711                   2          NaN        AXX
 3    3712                  20          NaN        AXX
 4    3713                   8          NaN        AXX
 5    3716                  16          NaN        AXX
 6    3717                   4          NaN        AXX,
                          0     1     2
 0           Sunspot number   134    17
 1              New regions     1     1
 2  10.7cm Solar Radio Flux   171     2
 3      Carrington Rotation  2285  2285,
                      0    1
 0  C-class solar flare  99%
 1  M-class solar flare  55%
 2  X-class solar flare  10%,
                         0           1          2
 0            Last X-flare  2024/06/10      X1.55
 1            Last M-flare  2024/06/15       M1.3
 2  Last geomagnetic storm  2024/06/15  Kp5+ (G1),
        Spotless days Spotless days.1
 0  Last spotless day      2022/06/08,
   Monthly mean Sunspot Number Monthly mean Sunspot Number.1
 0                    May 2024                   171.7 +35.2
 1                   June 2024                   157.1 -14.6
 2                Last 30 days                   146.2 -31.6,
    Solar flares  Solar flares.1 Solar flares.2
 0             1            2005          M5.72
 1             2            2003          M2.53
 2             3            2022           M1.6
 3             4            2003          M1.46
 4             5            2014          M1.45,
    Unnamed: 0  Unnamed: 1   Dst    G
 0           1        1965 -84.0   G3
 1           2        2023 -72.0   G2
 2           3        2003 -68.0   G2
 3           4        1989 -50.0  NaN
 4           5        1984 -48.0   G3]

In [10]:
import sqlite3

In [11]:
dir(sqlite3)

['Binary',
 'Blob',
 'Connection',
 'Cursor',
 'DataError',
 'DatabaseError',
 'Date',
 'DateFromTicks',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'LEGACY_TRANSACTION_CONTROL',
 'NotSupportedError',
 'OperationalError',
 'PARSE_COLNAMES',
 'PARSE_DECLTYPES',
 'PrepareProtocol',
 'ProgrammingError',
 'Row',
 'SQLITE_ABORT',
 'SQLITE_ABORT_ROLLBACK',
 'SQLITE_ALTER_TABLE',
 'SQLITE_ANALYZE',
 'SQLITE_ATTACH',
 'SQLITE_AUTH',
 'SQLITE_AUTH_USER',
 'SQLITE_BUSY',
 'SQLITE_BUSY_RECOVERY',
 'SQLITE_BUSY_SNAPSHOT',
 'SQLITE_BUSY_TIMEOUT',
 'SQLITE_CANTOPEN',
 'SQLITE_CANTOPEN_CONVPATH',
 'SQLITE_CANTOPEN_DIRTYWAL',
 'SQLITE_CANTOPEN_FULLPATH',
 'SQLITE_CANTOPEN_ISDIR',
 'SQLITE_CANTOPEN_NOTEMPDIR',
 'SQLITE_CANTOPEN_SYMLINK',
 'SQLITE_CONSTRAINT',
 'SQLITE_CONSTRAINT_CHECK',
 'SQLITE_CONSTRAINT_COMMITHOOK',
 'SQLITE_CONSTRAINT_FOREIGNKEY',
 'SQLITE_CONSTRAINT_FUNCTION',
 'SQLITE_CONSTRAINT_NOTNULL',
 'SQLITE_CONSTRAINT_PINNED',
 'SQLITE_CONSTRAINT_PRIMARYKEY',
 'SQLITE_CONSTRAINT_ROWID',
 'SQLITE_CONSTRAINT_TRIGGER',
 'SQLITE_CONSTRAINT_UNIQUE',
 'SQLITE_CONSTRAINT_VTAB',
 'SQLITE_CORRUPT',
 'SQLITE_CORRUPT_INDEX',
 'SQLITE_CORRUPT_SEQUENCE',
 'SQLITE_CORRUPT_VTAB',
 'SQLITE_CREATE_INDEX',
 'SQLITE_CREATE_TABLE',
 'SQLITE_CREATE_TEMP_INDEX',
 'SQLITE_CREATE_TEMP_TABLE',
 'SQLITE_CREATE_TEMP_TRIGGER',
 'SQLITE_CREATE_TEMP_VIEW',
 'SQLITE_CREATE_TRIGGER',
 'SQLITE_CREATE_VIEW',
 'SQLITE_CREATE_VTABLE',
 'SQLITE_DBCONFIG_DEFENSIVE',
 'SQLITE_DBCONFIG_DQS_DDL',
 'SQLITE_DBCONFIG_DQS_DML',
 'SQLITE_DBCONFIG_ENABLE_FKEY',
 'SQLITE_DBCONFIG_ENABLE_FTS3_TOKENIZER',
 'SQLITE_DBCONFIG_ENABLE_LOAD_EXTENSION',
 'SQLITE_DBCONFIG_ENABLE_QPSG',
 'SQLITE_DBCONFIG_ENABLE_TRIGGER',
 'SQLITE_DBCONFIG_ENABLE_VIEW',
 'SQLITE_DBCONFIG_LEGACY_ALTER_TABLE',
 'SQLITE_DBCONFIG_LEGACY_FILE_FORMAT',
 'SQLITE_DBCONFIG_NO_CKPT_ON_CLOSE',
 'SQLITE_DBCONFIG_RESET_DATABASE',
 'SQLITE_DBCONFIG_TRIGGER_EQP',
 'SQLITE_DBCONFIG_TRUSTED_SCHEMA',
 'SQLITE_DBCONFIG_WRITABLE_SCHEMA',
 'SQLITE_DELETE',
 'SQLITE_DENY',
 'SQLITE_DETACH',
 'SQLITE_DONE',
 'SQLITE_DROP_INDEX',
 'SQLITE_DROP_TABLE',
 'SQLITE_DROP_TEMP_INDEX',
 'SQLITE_DROP_TEMP_TABLE',
 'SQLITE_DROP_TEMP_TRIGGER',
 'SQLITE_DROP_TEMP_VIEW',
 'SQLITE_DROP_TRIGGER',
 'SQLITE_DROP_VIEW',
 'SQLITE_DROP_VTABLE',
 'SQLITE_EMPTY',
 'SQLITE_ERROR',
 'SQLITE_ERROR_MISSING_COLLSEQ',
 'SQLITE_ERROR_RETRY',
 'SQLITE_ERROR_SNAPSHOT',
 'SQLITE_FORMAT',
 'SQLITE_FULL',
 'SQLITE_FUNCTION',
 'SQLITE_IGNORE',
 'SQLITE_INSERT',
 'SQLITE_INTERNAL',
 'SQLITE_INTERRUPT',
 'SQLITE_IOERR',
 'SQLITE_IOERR_ACCESS',
 'SQLITE_IOERR_AUTH',
 'SQLITE_IOERR_BEGIN_ATOMIC',
 'SQLITE_IOERR_BLOCKED',
 'SQLITE_IOERR_CHECKRESERVEDLOCK',
 'SQLITE_IOERR_CLOSE',
 'SQLITE_IOERR_COMMIT_ATOMIC',
 'SQLITE_IOERR_CONVPATH',
 'SQLITE_IOERR_CORRUPTFS',
 'SQLITE_IOERR_DATA',
 'SQLITE_IOERR_DELETE',
 'SQLITE_IOERR_DELETE_NOENT',
 'SQLITE_IOERR_DIR_CLOSE',
 'SQLITE_IOERR_DIR_FSYNC',
 'SQLITE_IOERR_FSTAT',
 'SQLITE_IOERR_FSYNC',
 'SQLITE_IOERR_GETTEMPPATH',
 'SQLITE_IOERR_LOCK',
 'SQLITE_IOERR_MMAP',
 'SQLITE_IOERR_NOMEM',
 'SQLITE_IOERR_RDLOCK',
 'SQLITE_IOERR_READ',
 'SQLITE_IOERR_ROLLBACK_ATOMIC',
 'SQLITE_IOERR_SEEK',
 'SQLITE_IOERR_SHMLOCK',
 'SQLITE_IOERR_SHMMAP',
 'SQLITE_IOERR_SHMOPEN',
 'SQLITE_IOERR_SHMSIZE',
 'SQLITE_IOERR_SHORT_READ',
 'SQLITE_IOERR_TRUNCATE',
 'SQLITE_IOERR_UNLOCK',
 'SQLITE_IOERR_VNODE',
 'SQLITE_IOERR_WRITE',
 'SQLITE_LIMIT_ATTACHED',
 'SQLITE_LIMIT_COLUMN',
 'SQLITE_LIMIT_COMPOUND_SELECT',
 'SQLITE_LIMIT_EXPR_DEPTH',
 'SQLITE_LIMIT_FUNCTION_ARG',
 'SQLITE_LIMIT_LENGTH',
 'SQLITE_LIMIT_LIKE_PATTERN_LENGTH',
 'SQLITE_LIMIT_SQL_LENGTH',
 'SQLITE_LIMIT_TRIGGER_DEPTH',
 'SQLITE_LIMIT_VARIABLE_NUMBER',
 'SQLITE_LIMIT_VDBE_OP',
 'SQLITE_LIMIT_WORKER_THREADS',
 'SQLITE_LOCKED',
 'SQLITE_LOCKED_SHAREDCACHE',
 'SQLITE_LOCKED_VTAB',
 'SQLITE_MISMATCH',
 'SQLITE_MISUSE',
 'SQLITE_NOLFS',
 'SQLITE_NOMEM',
 'SQLITE_NOTADB',
 'SQLITE_NOTFOUND',
 'SQLITE_NOTICE',
 'SQLITE_NOTICE_RECOVER_ROLLBACK',
 'SQLITE_NOTICE_RECOVER_WAL',
 'SQLITE_OK',
 'SQLITE_OK_LOAD_PERMANENTLY',
 'SQLITE_OK_SYMLINK',
 'SQLITE_PERM',
 'SQLITE_PRAGMA',
 'SQLITE_PROTOCOL',
 'SQLITE_RANGE',
 'SQLITE_READ',
 'SQLITE_READONLY',
 'SQLITE_READONLY_CANTINIT',
 'SQLITE_READONLY_CANTLOCK',
 'SQLITE_READONLY_DBMOVED',
 'SQLITE_READONLY_DIRECTORY',
 'SQLITE_READONLY_RECOVERY',
 'SQLITE_READONLY_ROLLBACK',
 'SQLITE_RECURSIVE',
 'SQLITE_REINDEX',
 'SQLITE_ROW',
 'SQLITE_SAVEPOINT',
 'SQLITE_SCHEMA',
 'SQLITE_SELECT',
 'SQLITE_TOOBIG',
 'SQLITE_TRANSACTION',
 'SQLITE_UPDATE',
 'SQLITE_WARNING',
 'SQLITE_WARNING_AUTOINDEX',
 'Time',
 'TimeFromTicks',
 'Timestamp',
 'TimestampFromTicks',
 'Warning',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_deprecated_names',
 '_deprecated_version',
 '_deprecated_version_info',
 'adapt',
 'adapters',
 'apilevel',
 'collections',
 'complete_statement',
 'connect',
 'converters',
 'datetime',
 'dbapi2',
 'enable_callback_tracebacks',
 'paramstyle',
 'register_adapter',
 'register_converter',
 'sqlite_version',
 'sqlite_version_info',
 'threadsafety',
 'time']